class Yitem {
  
  final String imageUrl;
  final String ytext;
  final String description;

  static var length;

  Yitem(this.ytext, this.description, {this.imageUrl});
}

// list of products
// for our demo
List<Yitem> yitems = [
  Yitem(
    "Easy Pose Variation Belly",
    '''A. ခန္ဓာကိုယ်နှင့်စိတ်ကို တည်ငြိမ်စေခြင်းသည် ခန္ဓာကိုယ်ကို ပိုနားလည်စေပြီး ကိုယ်ဟန်အနေအထားတစ်ခုစီတွင် ဆန့်တန်းမှုများကို ကြည့်ရှုရန် ကူညီပေးသည့်အပြင် အတွေ့အကြုံကို ပျော်ရွှင်စေပါသည်။

 B. ဖျာအလယ်မှာထိုင်ပြီး မျက်လုံးမှိတ်ထားရင်းနဲ့ ကျောရိုးကို သက်တောင့်သက်သာရှိစေပြီး ခြေထောက်တွေကို ဖြတ်လိုက်ပါ။  အသက်ရှုခြင်းနှင့် ခန္ဓာကိုယ်လှုပ်ရှားမှုတို့ဖြင့် စတင်လုပ်ဆောင်ပါ။

 C. ဝမ်းနှင့်နီးကပ်သော လက်ဖဝါးဖြင့် ဤနေရာတွင် ထိုင်ပြီး ရှူသွင်းလိုက်စဉ် ဝမ်းကို နှေးကွေးစေပြီး ဝမ်းကျုံ့သွားသည်ကို ကြည့်ပါ။  ဤလှုပ်ရှားမှုကို ချိတ်ဆက်ပြီး မျက်နှာကြွက်သားများကို ပြေလျော့စေရန် စိတ်ကို ဆောင်ကျဉ်းပါ။

 D. အသက်ရှုသံ 12 ကြိမ် သို့မဟုတ် ထို့ထက်ပို၍ အသက်ရှုခြင်းနှင့် ခန္ဓာကိုယ် နှစ်ခုလုံး သက်တောင့်သက်သာ ခံစားရသည်အထိ ဤနေရာတွင် ထိုင်ပါ။  ပရာနာစီးဆင်းမှုလွယ်ကူစေရန် ကျောရိုးကိုမြှင့်တင်ရန် ကူရှင် သို့မဟုတ် စောင်ပေါ်တွင် ထိုင်နိုင်သည်။
''',
    imageUrl: "assets/images/yoga0.png",
  
  ),
  Yitem(
    "Revolved Bound Angle Pose",
    '''A. ရှူသွင်းပြီး ညာလက်ကို ဘယ်ဒူးပေါ်တင်ပြီး ထိုင်နေတုန်း အသက်ရှူသွင်းစဉ် ခန္ဓာကိုယ်ကို ဘယ်ဘက်ပခုံးနဲ့ ဦးခေါင်းကိုလည်း လှည့်ပါ။

 B. ဤလှည့်ကွက် သို့မဟုတ် Parivrtta Baddha Konasana သို့မဟုတ် Revolved Bound Angle Pose သည် ကျောရိုးအောက်ပိုင်းကို ဆန့်ထုတ်နိုင်ပြီး တင်ပါးကို ဖြည်းညှင်းစွာဖွင့်ရန် ကူညီပေးသည်။  ကျောရိုးနှင့် ကျောရိုးတစ်ဝိုက်ရှိ ကြွက်သားများ အားကောင်းလေ၊ တင်ပါးကို လွယ်လွယ်ကူကူ ဆန့်ထုတ်ရန် ကူညီပေးသည်။

 C. ဤကိုယ်ဟန်ဖြင့် ၄ ကြိမ်ခန့် အသက်ရှူပြီး လှည့်လိုက်ခြင်းဖြင့် ကျောရိုး၏ ခြေရင်းသို့ ဆန့်ထွက်မှုကို ပိုမိုခံစားရစေသည်။
''',
    imageUrl: "assets/images/yoga1.png",
  ),
  Yitem(
    "Staff Pose",
    '''A. သင့်ရှေ့တွင် ခြေထောက်များကို ဆန့်ထုတ်ကာ သက်တောင့်သက်သာရှိသော ကိုယ်ဟန်အနေအထားဖြင့် ဆန့်တန်းထိုင်ပါ။

B. ခြေထောက်များကို ထုတ်ပစ်ခြင်းဖြင့် အဆစ်တစ်ဝိုက်တင်းကျပ်မှုကို သက်သာစေရန် ခြေကျင်းဝတ်များနှင့် ခြေဖဝါးများကို လှုပ်ရှားနိုင်ပြီး သက်တောင့်သက်သာရှိသည်အထိ ၄ ကြိမ်ခန့် အသက်ရှူပြီးထိုင်ပါ။

 C. အသက်ရှုလမ်းကြောင်းကို ချိတ်ဆက်ရန်၊ ခန္ဓာကိုယ်ကို သက်တောင့်သက်သာရှိစေပြီး သွေးစီးဆင်းမှုကို ကောင်းမွန်စေကာ အောက်ဆီဂျင်ပမာဏ မှန်ကန်စွာ စီးဆင်းမှုကိုလည်း ကူညီပေးသည်။  စိတ်ကို ပြေလျော့စေခြင်းသည် အစားအသောက်အမျိုးမျိုးမှ ကင်းဝေးရန် အလွန်အရေးကြီးပြီး သွေးတွင်းသကြားဓာတ်သည် အလွန်အဖြစ်များသောကြောင့် ဤအလေ့အကျင့်သည် အရေးကြီးလာပါသည်။
''',
    imageUrl: "assets/images/yoga2.png",
  ),
  Yitem(
    "Boat Pose",
    '''ရှူသွင်းပြီး ခေါင်းကို မြှောက်ထားပြီး မေးစေ့ကို ရင်ဘတ်နဲ့ အပြိုင်ထားပါ။

B. လက်နှစ်ဖက်ကို ဖြေလျှော့ပြီး ဒူးကို ရင်ဘတ်ဆီသို့ ပို့ဆောင်ပါ။
ရှူထုတ်ပြီး ခေါင်းကိုငုံ့ထားပါ။

C. အသက်သွင်းပြီး ခြေထောက်တွေကို 90 ဒီဂရီ ဖြောင့်တန်းပြီး ခြေဖဝါးကို ဆန့်တန်းထားပါ။

D. လက်နှစ်ဖက်ကို ၄၅ ဒီဂရီ မြှောက်ပြီး ဒူးဆီသို့ လက်နှစ်ဖက်ကို မျက်နှာမူပါ။
အသက်သွင်းပြီး မေးစေ့ကို ရင်ဘတ်သို့ မြှောက်ပါ။

E. ခြေချောင်းတွေကို ညွှန်ပြီး အသက်ရှူထုတ်ပြီး ခြေထောက်တွေကို 45 ဒီဂရီထိ ယူပါ။
ရှူသွင်းပြီး မတ်မတ်ထိုင်ပြီး အရိုးများကို ဟန်ချက်ညီအောင် ထိန်းကာ လိုအပ်ပါက ဒူးကို ကွေးထားပါ။

F. ရင်ဘတ်ကို မြှောက်ထားပြီး ကျောရိုးကို ရှည်ထားပါ။

G. ရှူထုတ်ပြီး လက်ကိုလွှတ်ကာ မူလအနေအထားသို့ ပြန်သွားပါ။
''',
    imageUrl: "assets/images/yoga3.png",
  ),
  Yitem(
    "Half Plough Pose",
    '''A. အသက်ရှူသွင်းခြင်း - ခြေထောက်များကို ဒူးနှစ်ဖက်ကိုကွေးပြီး ခြေထောက်များကို ကြမ်းပြင်ပေါ်မှ မြှောက်ထားပါ။
 Exhale - ရင်ဘတ်နဲ့ ဝမ်းကို ဖိပြီး ပေါင်ကို ၁ ချက်လောက် ရှူပါ။
 အသက်ရှူသွင်းခြင်း - ဖြစ်နိုင်လျှင် တင်ပါးကို မမြှောက်ဘဲ ခြေထောက်များကို 90 ဒီဂရီအထိ ဆန့်ထုတ်ပါ။
 Exhale/Inhale - တစ်ဝက်ထွန်နေဖို့ လက်နှစ်ဖက်ကို မြေကြီးပေါ်ကနေ တစ်ဖက်ကို တင်ပါ။
 Inhale/Exhale - အသက် 6 ချက်လောက်နေဖို့၊ အူမကြီးကြွက်သားတွေကို ဆွဲထုတ်လိုက်တဲ့အခါ။
 Exhale - ခြေထောက်တွေကို လွှတ်ချလိုက်ပြီး ဖြေလျှော့လိုက်ပါ။

B. အူတိုင်ကြွက်သားများ ချိတ်ဆက်မိသောအခါ အောက်ပိုင်းသည် သန်မာလာသည်။  ကျောရိုးကြွက်သားများ တက်ကြွနေစေရန် ကျောရိုးကို မြေပြင်ဆီသို့ တွန်းပို့နေစဉ် တင်ပါးဆုံတွင်း၊ အူတိုင်၊ ခြေထောက်များနှင့် တင်ပါးများကို ပူနွေးစေသည့် နည်းလမ်းကောင်းတစ်ခုဖြစ်သည်။  အူတိုင်ကြွက်သားများကို သိရှိနားလည်ခြင်းဖြင့် ကျောင်းသားများသည် အလုပ်လုပ်ရန် လိုအပ်သည့် အားနည်းသောကြွက်သားများကို နားလည်ကူညီပေးရန်အတွက် ၎င်းတို့၏ခန္ဓာကိုယ်နှင့် ပိုမိုကောင်းမွန်သော ဆက်သွယ်မှုတစ်ခု ရရှိနိုင်ပါသည်။
''',
    imageUrl: "assets/images/yoga4.png",
  ),
  Yitem(
    "Seated Mountain Pose Thunderbolt",
    '''A. ထိုင်နေသည့် အခြေအနေတွင် ဒူးထောက်ကာ တင်ပါးကို ဒေါက်နှင့် တင်ပါးဖြင့် စတင်ပါ။  မင်းပုခုံးတွေကို နောက်ပြန်လှန်ပြီး ရင်ဘတ်ကိုဖွင့်ဖို့ ဒီမှာ ခဏလောက်နေလိုက်ပါ။

 B. သင်ရှူသွင်းလိုက်သောအခါတွင် သင့်လက်မောင်းများကို အပေါ်မှပွတ်ဆွဲကာ လက်ဖဝါးနှစ်ဖက်ကို တွဲချိတ်ပါ။  ပခုံးများကို နားရွက်ဆီသို့ ယူဆောင်လာခြင်းကို ရှောင်ကြဉ်ပြီး ကျောရိုးအရှည်ကို ဖန်တီးရန် အာရုံစိုက်ပါ။

 C. ရင်ဘတ်ကို ရင်ဘတ်သို့ ရောက်သွားသည်နှင့် အမျှ ထွက်သက်ဝင်သက်ကို သတိထား၍ နောက်တဖန် ပြန်ထွက်ပါ။  ဤကိုယ်ဟန်ကို နက်နဲသော၊ သက်တောင့်သက်သာရှိသော အသက်ရှုမှု (၅)ချက်ကို ကိုင်ထားပါ။
''',
    imageUrl: "assets/images/yoga500.png",
  ),
  Yitem(
    "Eagle Pose",
    '''A. ခြေထောက်များကို အခြားအပေါ်မှ ဒူးတစ်လုံးစီချထားခြင်းဖြင့် ခြေထောက်များကို ယှက်ထားပါ၊ ဤအခြေအနေတွင် ဘယ်ဒူးကို ညာဘက်ဒူးအထက်တွင် ထားကာ ဘယ်ခြေကို ဖြည်းဖြည်းချင်းယူ၍ ညာဘက်ခြေကျင်းဝတ်နောက်တွင် ထားကာ ဒူးကို အနည်းငယ်ကွေးစေပါသည်။

B. ယခု နောက်ထပ် အာနာပါန နှင့် တံတောင်ဆစ်တွင် လက်နှစ်ဖက်ကို ယှက်ထားပါ၊ ဤကိစ္စတွင်၊ ညာဘက်တံတောင်ဆစ်ကို ဘယ်ဘက်တံတောင်ဆစ်ပေါ်တင်ပြီး လက်ဖဝါးများကို ဖမ်းပြီး လက်နှစ်ဖက်လုံး၏ လက်ချောင်းထိပ်များကို ချိတ်ကာ Namaste ဖြင့် ဖိထားပါ။

ဂ။ ဒူးကိုကွေးပြီး ရိုးရှင်းသော ကိုယ်ဟန်အနေအထားသည် ခန္ဓာကိုယ်အပေါ်ပိုင်းတစ်ခုလုံးကို အနည်းငယ်ကွေးပြီး အောက်တင်ပါးပေါ်တွင် တင်ထားသောကြောင့် တင်ပါးကြွက်သားများ၏ အဖွင့်ကို ဖန်တီးပေးမည်ဖြစ်သည်။  ဤနေရာ၌ အာနာပါနသုံးပါးကို ရှုပါ။
''',
    imageUrl: "assets/images/yoga60.png",
  ),
  Yitem(
    "Tree Pose",
    '''သင့်တင်ပါးနှင့် တင်ပါးဆုံရိုးကို တည်ငြိမ်စေပြီး ခန္ဓာကိုယ်ကို အရပ်ရှည်ပြီး ဖြောင့်တန်းနေအောင်ထားပါ။

B. ဘယ်ခြေကို ကြမ်းပြင်ပေါ်တင်ပြီး ညာဒူးကို ကွေးလိုက်ပါ။
ညာခြေထောက်ခြေချင်းဝတ်ကို ဆုပ်ကိုင်ပြီး ညာဘက်ခြေဖဝါးကို ဘယ်ဘက်ပေါင်အတွင်းဘက်တွင် ထားပေးပါ။

C. ညာဘက်ခြေဖနောင့်သည် perineum နှင့် အပေါ်ပိုင်းအတွင်းပိုင်းပေါင်နှင့် နီးကပ်သည်။  ခြေချောင်းတွေက အောက်ကို ညွှန်ပြပြီး ညာဘက်ဒူးကို ဘေးတိုက် မျက်နှာမူထားပါတယ်။

D. လက်ကို ရင်ဘတ်ရှေ့တွင် ဦးစွာဆုတောင်းသည့် အနေအထားတွင်ယူပြီး ဤကိုယ်ဟန်အနေအထားတွင် အသက် 5 ချက်မျှ တည်ငြိမ်အောင် စတင်ပါ။

E. သတ်မှတ်ထားတဲ့ အချက်တစ်ချက်ကို ကြည့်ပြီး ညီညီညာညာ အသက်ရှူပါ။
လည်ပင်းကို ကျောရိုးသို့ ပြန်ဆွဲယူပြီး ဘက်မလိုက်သော ကျောရိုးကို ထိန်းသိမ်းပါ။

F. လက်နှစ်ဖက်လုံးကို မျက်နှာကျက်ပေါ်သို့ မြှောက်ပြီး ခေါင်းပေါ်မှ လက်ဖဝါးများကို ညင်သာစွာ ဖိထားပါ။

G. ခြေထောက်ကို 5 ချက်လောက် အသက်ရှုသွင်းပြီး လက်နှစ်ဖက်ကို ဖြည်းဖြည်းချင်း လွှတ်ပြီး ခြေထောက်ကို နောက်ဆုံးမှချလိုက်ပါ။
 တစ်ဖက်ကို ပြန်လုပ်ပါ။
''',
    imageUrl: "assets/images/yoga9.png",
  ),
  Yitem(
    "Reverse Warrior Pose",
    '''A. ခြေဖဝါး ၄ ပေခန့် အကွာတွင် ရပ်ပါ။  ခြေထောက်ကို တစ်ဖက်နှင့်တစ်ဖက် အပြိုင်ထားပါ။

 B. ညာဘက်ခြေကို 90 ဒီဂရီ လှန်ထားပါ။  လေးထောင့်နှင့် တင်ပါးကို ဗဟိုပြုပါ။

 C. အသက်သွင်းပြီး လက်နှစ်ဖက်ကို ပခုံးအဆင့်အထိ မြှင့်ပါ။

 D. အသက်ရှူထုတ်ပြီး ညာဘက်ဒူးကို 90 ဒီဂရီ ကွေးပြီး အူတိုင်ကို တက်ကြွနေအောင် ထားပြီး ညာဘက်လက်မောင်းကို အပေါ်ကနေ နက်နဲတဲ့ ဆန့်ထုတ်လိုက်ပါ။  ဘယ်ဘက်ခြေသလုံး/ခြေသလုံးကြွက်သားပေါ်ရှိ ဘယ်လက်မောင်းကို ဖြေလျှော့ပါ (ဘယ်ဘက်လက်ဖဝါးတွင် မည်သည့်အလေးချိန်မျှမရှိဘဲ)။

 E. ဤနေရာတွင် အနားယူပြီး ဝမ်းဗိုက်အောက်ပိုင်း သို့မဟုတ် Sacral Chakra တွင် လုံးလုံးအသိဖြင့် 10 ကြိမ်ခန့် အသက်ရှူပြီးပါ။

 F. အပြင်ထွက်ရန်၊ သင်၏လက်များကို ရှူထုတ်ပြီး ဖြေလျှော့ပါ။  ညာဘက်ခြေကို A အနေအထားသို့ယူပါ။

 နောက် pose တွင် တစ်ဖက်တွင် မူလအတိုင်းပြန်လုပ်ပါ။
''',
    imageUrl: "assets/images/yoga10.png",
  ),
  ];
